pwbf/RX64M_Vibration/src/r_ether_rx/src/targets/rx/r_ether_setting_rx.c
/***********************************************************************************************************************
* Function Name: ether_clear_icu_source
* Description  :
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
void ether_clear_icu_source(uint32_t channel)
{
    ICU.IR[IR_ICU_GROUPAL1].BIT.IR = 0;
    
    if (ETHER_CHANNEL_0 == channel)
    {
        ICU.GRPAL1.BIT.IS4 = 0;
    }
    else
    {
        ICU.GRPAL1.BIT.IS5 = 0;
    }
} /* End of function ether_clear_icu_source() */

/***********************************************************************************************************************
* Function Name: ether_port_enable
* Description  :
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
void ether_port_enable(uint8_t connect)
{
/* Port pins default to inputs. To ensure safe initialization set the pin states
   before changing the data direction registers. This will avoid any unintentional
   state changes on the external ports.
   Many peripheral modules will override the setting of the port registers. Ensure
   that the state is safe for external devices if the internal peripheral module is
   disabled or powered down. */

#if ETHER_CFG_MODE_SEL == 0 /* MII */
    ether_port_enable_mii(connect);
#endif

#if ETHER_CFG_MODE_SEL == 1 /* RMII */
    ether_port_enable_rmii(connect);
#endif

} /* End of function ether_port_enable() */

/***********************************************************************************************************************
* Function Name: ether_port_disable
* Description  :
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
void ether_port_disable(uint8_t connect)
{
#if ETHER_CFG_MODE_SEL == 0 /* MII */
    ether_port_disable_mii(connect);
#endif

#if ETHER_CFG_MODE_SEL == 1 /* RMII */
    ether_port_disable_rmii(connect);
#endif

} /* End of function ether_port_disable() */

#if ETHER_CFG_MODE_SEL == 0 /* MII */
/***********************************************************************************************************************
* Function Name: ether_port_enable_mii
* Description  : Configures port pins.
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_port_enable_mii(uint8_t connect)
{
    /* Clear PDR and PMR */
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
    /*
    Pin Functions : Port
    --------------------
    ET0_TX_CLK     : PC4
    ET0_RX_CLK     : P76
    ET0_TX_EN      : P80
    ET0_ETXD3      : PC6
    ET0_ETXD2      : PC5
    ET0_ETXD1      : P82
    ET0_ETXD0      : P81
    ET0_TX_ER      : PC3
    ET0_RX_DV      : PC2
    ET0_ERXD3      : PC0
    ET0_ERXD2      : PC1
    ET0_ERXD1      : P74
    ET0_ERXD0      : P75
    ET0_RX_ER      : P77
    ET0_CRS        : P83
    ET0_COL        : PC7
    ET0_MDC        : P72
    ET0_MDIO       : P71
    ET0_LINKSTA    : P34
    ET_EXOUT       : NC
    ET_WOL         : NC
    */
        /* ET0 */
        PORT3.PDR.BIT.B4 = 0;
        PORT7.PDR.BIT.B1 = 0;
        PORT7.PDR.BIT.B2 = 0;
        PORT7.PDR.BIT.B4 = 0;
        PORT7.PDR.BIT.B5 = 0;
        PORT7.PDR.BIT.B6 = 0;
        PORT7.PDR.BIT.B7 = 0;
        PORT8.PDR.BIT.B0 = 0;
        PORT8.PDR.BIT.B1 = 0;
        PORT8.PDR.BIT.B2 = 0;
        PORT8.PDR.BIT.B3 = 0;
        PORTC.PDR.BYTE   = 0x00;
        
        PORT3.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B1 = 0;
        PORT7.PMR.BIT.B2 = 0;
        PORT7.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B5 = 0;
        PORT7.PMR.BIT.B6 = 0;
        PORT7.PMR.BIT.B7 = 0;
        PORT8.PMR.BIT.B0 = 0;
        PORT8.PMR.BIT.B1 = 0;
        PORT8.PMR.BIT.B2 = 0;
        PORT8.PMR.BIT.B3 = 0;
        PORTC.PMR.BYTE   = 0x00;
    }

    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
    /*
    Pin Functions : Port
    --------------------
    ET1_TX_CLK     : PG2
    ET1_RX_CLK     : PG0
    ET1_TX_EN      : P60
    ET1_ETXD3      : PG6
    ET1_ETXD2      : PG5
    ET1_ETXD1      : PG4
    ET1_ETXD0      : PG3
    ET1_TX_ER      : PG7
    ET1_RX_DV      : P90
    ET1_ERXD3      : P97
    ET1_ERXD2      : P96
    ET1_ERXD1      : P95
    ET1_ERXD0      : P94
    ET1_RX_ER      : PG1
    ET1_CRS        : P92
    ET1_COL        : P91
    ET1_MDC        : P31
    ET1_MDIO       : P30
    ET1_LINKSTA    : P93
    */
        /* ET1 */
        PORT3.PDR.BIT.B0 = 0;
        PORT3.PDR.BIT.B1 = 0;
        PORT6.PDR.BIT.B0 = 0;
        PORT9.PDR.BIT.B0 = 0;
        PORT9.PDR.BIT.B1 = 0;
        PORT9.PDR.BIT.B2 = 0;
        PORT9.PDR.BIT.B3 = 0;       /* LINKSTA */
        PORT9.PDR.BIT.B4 = 0;
        PORT9.PDR.BIT.B5 = 0;
        PORT9.PDR.BIT.B6 = 0;
        PORT9.PDR.BIT.B7 = 0;
        PORTG.PDR.BYTE   = 0x00;
        
        PORT3.PMR.BIT.B0 = 0;
        PORT3.PMR.BIT.B1 = 0;
        PORT6.PMR.BIT.B0 = 0;
        PORT9.PMR.BIT.B0 = 0;
        PORT9.PMR.BIT.B1 = 0;
        PORT9.PMR.BIT.B2 = 0;
        PORT9.PMR.BIT.B3 = 0;       /* LINKSTA */
        PORT9.PMR.BIT.B4 = 0;
        PORT9.PMR.BIT.B5 = 0;
        PORT9.PMR.BIT.B6 = 0;
        PORT9.PMR.BIT.B7 = 0;
        PORTG.PMR.BYTE   = 0x00;
    }

    /* PFS register write protect off */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);
   
    /* Select pin function */
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
        /* ET0 */
        MPC.P34PFS.BYTE = 0x11;
        MPC.P71PFS.BYTE = 0x11;
        MPC.P72PFS.BYTE = 0x11;
        MPC.P74PFS.BYTE = 0x11;
        MPC.P75PFS.BYTE = 0x11;
        MPC.P76PFS.BYTE = 0x11;
        MPC.P77PFS.BYTE = 0x11;
        MPC.P80PFS.BYTE = 0x11;
        MPC.P81PFS.BYTE = 0x11;
        MPC.P82PFS.BYTE = 0x11;
        MPC.P83PFS.BYTE = 0x11;
        MPC.PC0PFS.BYTE = 0x11;
        MPC.PC1PFS.BYTE = 0x11;
        MPC.PC2PFS.BYTE = 0x11;
        MPC.PC3PFS.BYTE = 0x11;
        MPC.PC4PFS.BYTE = 0x11;
        MPC.PC5PFS.BYTE = 0x11;
        MPC.PC6PFS.BYTE = 0x11;
        MPC.PC7PFS.BYTE = 0x11;
    }


