pwbf/RX64M_Vibration/src/r_ether_rx/src/targets/rx/r_ether_setting_rx.c
    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
        /* ET1 */
        MPC.P30PFS.BYTE = 0x14;
        MPC.P31PFS.BYTE = 0x14;
        MPC.P60PFS.BYTE = 0x14;
        MPC.P90PFS.BYTE = 0x14;
        MPC.P91PFS.BYTE = 0x14;
        MPC.P92PFS.BYTE = 0x14;
        MPC.P93PFS.BYTE = 0x14;      /* LINKSTA */

        MPC.P94PFS.BYTE = 0x14;
        MPC.P95PFS.BYTE = 0x14;
        MPC.P96PFS.BYTE = 0x14;
        MPC.P97PFS.BYTE = 0x14;
        MPC.PG0PFS.BYTE = 0x14;
        MPC.PG1PFS.BYTE = 0x14;
        MPC.PG2PFS.BYTE = 0x14;
        MPC.PG3PFS.BYTE = 0x14;
        MPC.PG4PFS.BYTE = 0x14;
        MPC.PG5PFS.BYTE = 0x14;
        MPC.PG6PFS.BYTE = 0x14;
        MPC.PG7PFS.BYTE = 0x14;
    }

    /* PFS register write protect on */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);
    
    /* Switch to the selected input/output function */
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
        /* ET0 */
        MPC.PFENET.BIT.PHYMODE0 = 1; /* Select Ethernet mode    MII mode for ch0 */

        PORT3.PMR.BIT.B4 = 1;
        PORT7.PMR.BIT.B1 = 1;
        PORT7.PMR.BIT.B2 = 1;
        PORT7.PMR.BIT.B4 = 1;
        PORT7.PMR.BIT.B5 = 1;
        PORT7.PMR.BIT.B6 = 1;
        PORT7.PMR.BIT.B7 = 1;
        PORT8.PMR.BIT.B0 = 1;
        PORT8.PMR.BIT.B1 = 1;
        PORT8.PMR.BIT.B2 = 1;
        PORT8.PMR.BIT.B3 = 1;
        PORTC.PMR.BYTE   = 0xFF;
    }
    
    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
        /* ET1 */
        MPC.PFENET.BIT.PHYMODE1 = 1; /* Select Ethernet mode    MII mode for ch1 */

        PORT3.PMR.BIT.B0 = 1;
        PORT3.PMR.BIT.B1 = 1;
        PORT6.PMR.BIT.B0 = 1;
        PORT9.PMR.BIT.B0 = 1;
        PORT9.PMR.BIT.B1 = 1;
        PORT9.PMR.BIT.B2 = 1;
        PORT9.PMR.BIT.B3 = 1;       /* LINKSTA */
        PORT9.PMR.BIT.B4 = 1;
        PORT9.PMR.BIT.B5 = 1;
        PORT9.PMR.BIT.B6 = 1;
        PORT9.PMR.BIT.B7 = 1;
        PORTG.PMR.BYTE   = 0xFF;
    }
} /* End of function ether_port_enable_mii() */

/***********************************************************************************************************************
* Function Name: ether_port_disable_mii
* Description  : Configures port pins.
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_port_disable_mii(uint8_t connect)
{
    /* Clear PDR and PMR */
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
    /*
    Pin Functions : Port
    --------------------
    ET0_TX_CLK     : PC4
    ET0_RX_CLK     : P76
    ET0_TX_EN      : P80
    ET0_ETXD3      : PC6
    ET0_ETXD2      : PC5
    ET0_ETXD1      : P82
    ET0_ETXD0      : P81
    ET0_TX_ER      : PC3
    ET0_RX_DV      : PC2
    ET0_ERXD3      : PC0
    ET0_ERXD2      : PC1
    ET0_ERXD1      : P74
    ET0_ERXD0      : P75
    ET0_RX_ER      : P77
    ET0_CRS        : P83
    ET0_COL        : PC7
    ET0_MDC        : P72
    ET0_MDIO       : P71
    ET0_LINKSTA    : P34
    ET_EXOUT       : NC
    ET_WOL         : NC
    */
        /* ET0 */
        PORT3.PODR.BIT.B4 = 0;      /* ET0_LINKSTA -> P34(don't care) */
        PORT7.PODR.BIT.B1 = 0;      /* ET0_MDIO    -> P71(don't care) */
        PORT7.PODR.BIT.B2 = 0;      /* ET0_MDC     -> P72(Low Output) 
                                       So as not to take data when the state of MDC is irregularity, Low is output from
                                        MDC. */
        PORT7.PODR.BIT.B4 = 0;      /* ET0_ERXD1   -> P74(don't care) */
        PORT7.PODR.BIT.B5 = 0;      /* ET0_ERXD0   -> P75(don't care) */
        PORT7.PODR.BIT.B6 = 0;      /* ET0_RX_CLK  -> P76(don't care) */
        PORT7.PODR.BIT.B7 = 0;      /* ET0_RX_ER   -> P77(don't care) */
        PORT8.PODR.BIT.B0 = 0;      /* ET0_TX_EN   -> P80(Low Output:deassert) */
        PORT8.PODR.BIT.B1 = 0;      /* ET0_ETXD0   -> P81(Low Output) */
        PORT8.PODR.BIT.B2 = 0;      /* ET0_ETXD1   -> P82(Low Output) */
        PORT8.PODR.BIT.B3 = 0;      /* ET0_CRS     -> P83(don't care) */
        PORTC.PODR.BYTE = 0x00;     /* ET0_COL     -> PC7(don't care)
                                       ET0_ETXD3   -> PC6(Low Output)
                                       ET0_ETXD2   -> PC5(Low Output)
                                       ET0_TX_CLK  -> PC4(don't care)
                                       ET0_TX_ER   -> PC3(Low Output:deassert)
                                       ET0_RX_DV   -> PC2(don't care)
                                       ET0_ERXD2   -> PC1(don't care)
                                       ET0_ERXD3   -> PC0(don't care) */

        PORT3.PDR.BIT.B4 = 0;       /* ET0_LINKSTA -> P34(I/O:Input) */
        PORT7.PDR.BIT.B1 = 0;       /* ET0_MDIO    -> P71(I/O:Input) */
        PORT7.PDR.BIT.B2 = 1;       /* ET0_MDC     -> P72(I/O:Output)*/
        PORT7.PDR.BIT.B4 = 0;       /* ET0_ERXD1   -> P74(I/O:Input) */
        PORT7.PDR.BIT.B5 = 0;       /* ET0_ERXD0   -> P75(I/O:Input) */
        PORT7.PDR.BIT.B6 = 0;       /* ET0_RX_CLK  -> P76(I/O:Input) */
        PORT7.PDR.BIT.B7 = 0;       /* ET0_RX_ER   -> P77(I/O:Input) */
        PORT8.PDR.BIT.B0 = 1;       /* ET0_TX_EN   -> P80(I/O:Output)*/
        PORT8.PDR.BIT.B1 = 1;       /* ET0_ETXD0   -> P81(I/O:Output)*/
        PORT8.PDR.BIT.B2 = 1;       /* ET0_ETXD1   -> P82(I/O:Output)*/
        PORT8.PDR.BIT.B3 = 0;       /* ET0_CRS     -> P83(I/O:Input) */
        
         PORTC.PDR.BYTE = 0x78;     /* ET0_COL    -> PC7(I/O:Input)
                                       ET0_ETXD3  -> PC6(I/O:Output)
                                       ET0_ETXD2  -> PC5(I/O:Output)
                                       ET0_TX_CLK -> PC4(I/O:Output)
                                       ET0_TX_ER  -> PC3(I/O:Output)
                                       ET0_RX_DV  -> PC2(I/O:Input)
                                       ET0_ERXD2  -> PC1(I/O:Input)
                                       ET0_ERXD3  -> PC0(I/O:Input)  */

        PORT3.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B1 = 0;
        PORT7.PMR.BIT.B2 = 0;
        PORT7.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B5 = 0;
        PORT7.PMR.BIT.B6 = 0;
        PORT7.PMR.BIT.B7 = 0;
        PORT8.PMR.BIT.B0 = 0;
        PORT8.PMR.BIT.B1 = 0;
        PORT8.PMR.BIT.B2 = 0;
        PORT8.PMR.BIT.B3 = 0;
        PORTC.PMR.BYTE   = 0xFF;
    }

