pwbf/RX64M_Vibration/src/r_ether_rx/src/targets/rx/r_ether_setting_rx.c
    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
    /*
    Pin Functions : Port
    --------------------
    ET1_TX_CLK     : PG2
    ET1_RX_CLK     : PG0
    ET1_TX_EN      : P60
    ET1_ETXD3      : PG6
    ET1_ETXD2      : PG5
    ET1_ETXD1      : PG4
    ET1_ETXD0      : PG3
    ET1_TX_ER      : PG7
    ET1_RX_DV      : P90
    ET1_ERXD3      : P97
    ET1_ERXD2      : P96
    ET1_ERXD1      : P95
    ET1_ERXD0      : P94
    ET1_RX_ER      : PG1
    ET1_CRS        : P92
    ET1_COL        : P91
    ET1_MDC        : P31
    ET1_MDIO       : P30
    ET1_LINKSTA    : P93
    */
        /* ET1 */
        PORT3.PODR.BIT.B0 = 0;      /* ET1_MDIO   -> P30(don't care) */        
        PORT3.PODR.BIT.B1 = 0;      /* ET1_MDC    -> P31(Low Output) 
                                       So as not to take data when the state of MDC is irregularity, Low is output from
                                        MDC. */
        PORT6.PODR.BIT.B0 = 0;      /* ET1_TX_EN  -> P60(Low Output:deassert) */
        PORT9.PODR.BIT.B0 = 0;      /* ET1_RX_DV  -> P90(don't care) */
        PORT9.PODR.BIT.B1 = 0;      /* ET1_COL    -> P91(don't care) */
        PORT9.PODR.BIT.B2 = 0;      /* ET1_CRS    -> P92(don't care) */
        PORT9.PODR.BIT.B3 = 0;      /* LINKSTA    -> P93(don't care) */
        PORT9.PODR.BIT.B4 = 0;      /* ET1_ERXD0  -> P94(don't care) */
        PORT9.PODR.BIT.B5 = 0;      /* ET1_ERXD1  -> P95(don't care) */
        PORT9.PODR.BIT.B6 = 0;      /* ET1_ERXD2  -> P96(don't care) */
        PORT9.PODR.BIT.B7 = 0;      /* ET1_ERXD3  -> P97(don't care) */
        PORTG.PODR.BIT.B0 = 0;      /* ET1_RX_CLK -> PG0(don't care) */
        PORTG.PODR.BIT.B1 = 0;      /* ET1_RX_ER  -> PG1(don't care) */
        PORTG.PODR.BIT.B2 = 0;      /* ET1_TX_CLK -> PG2(don't care) */
        PORTG.PODR.BIT.B3 = 0;      /* ET1_ETXD0  -> PG3(Low Output) */
        PORTG.PODR.BIT.B4 = 0;      /* ET1_ETXD1  -> PG4(Low Output) */
        PORTG.PODR.BIT.B5 = 0;      /* ET1_ETXD2  -> PG5(Low Output) */
        PORTG.PODR.BIT.B6 = 0;      /* ET1_ETXD3  -> PG6(Low Output) */
        PORTG.PODR.BIT.B7 = 0;      /* ET1_TX_ER  -> PG7(Low Output:deassert) */

        PORT3.PDR.BIT.B0 = 0;       /* ET1_MDIO   -> P30(I/O:Input)  */
        PORT3.PDR.BIT.B1 = 1;       /* ET1_MDC    -> P31(I/O:Output) */
        PORT6.PDR.BIT.B0 = 1;       /* ET1_TX_EN  -> P60(I/O:Output) */
        PORT9.PDR.BIT.B0 = 0;       /* ET1_RX_DV  -> P90(I/O:Input)  */
        PORT9.PDR.BIT.B1 = 0;       /* ET1_COL    -> P91(I/O:Input)  */
        PORT9.PDR.BIT.B2 = 0;       /* ET1_CRS    -> P92(I/O:Input)  */
        PORT9.PDR.BIT.B3 = 0;       /* LINKSTA    -> P93(I/O:Input)  */
        PORT9.PDR.BIT.B4 = 0;       /* ET1_ERXD0  -> P94(I/O:Input)  */
        PORT9.PDR.BIT.B5 = 0;       /* ET1_ERXD1  -> P95(I/O:Input)  */
        PORT9.PDR.BIT.B6 = 0;       /* ET1_ERXD2  -> P96(I/O:Input)  */
        PORT9.PDR.BIT.B7 = 0;       /* ET1_ERXD3  -> P97(I/O:Input)  */
        PORTG.PDR.BIT.B0 = 0;       /* ET1_RX_CLK -> PG0(I/O:Input)  */
        PORTG.PDR.BIT.B1 = 0;       /* ET1_RX_ER  -> PG1(I/O:Input)  */
        PORTG.PDR.BIT.B2 = 1;       /* ET1_TX_CLK -> PG2(I/O:Output) */
        PORTG.PDR.BIT.B3 = 1;       /* ET1_ETXD0  -> PG3(I/O:Output) */
        PORTG.PDR.BIT.B4 = 1;       /* ET1_ETXD1  -> PG4(I/O:Output) */
        PORTG.PDR.BIT.B5 = 1;       /* ET1_ETXD2  -> PG5(I/O:Output) */
        PORTG.PDR.BIT.B6 = 1;       /* ET1_ETXD3  -> PG6(I/O:Output) */
        PORTG.PDR.BIT.B7 = 1;       /* ET1_TX_ER  -> PG7(I/O:Output) */

        PORT3.PMR.BIT.B0 = 0;
        PORT3.PMR.BIT.B1 = 0;
        PORT6.PMR.BIT.B0 = 0;
        PORT9.PMR.BIT.B0 = 0;
        PORT9.PMR.BIT.B1 = 0;
        PORT9.PMR.BIT.B2 = 0;
        PORT9.PMR.BIT.B3 = 0;
        PORT9.PMR.BIT.B4 = 0;
        PORT9.PMR.BIT.B5 = 0;
        PORT9.PMR.BIT.B6 = 0;
        PORT9.PMR.BIT.B7 = 0;
        PORTG.PMR.BIT.B0 = 0;
        PORTG.PMR.BIT.B1 = 0;
        PORTG.PMR.BIT.B2 = 0;
        PORTG.PMR.BIT.B3 = 0;
        PORTG.PMR.BIT.B4 = 0;
        PORTG.PMR.BIT.B5 = 0;
        PORTG.PMR.BIT.B6 = 0;
        PORTG.PMR.BIT.B7 = 0;
    }

} /* End of function ether_port_disable_mii() */

#endif

#if ETHER_CFG_MODE_SEL == 1 /* RMII */
/***********************************************************************************************************************
* Function Name: ether_port_enable_rmii
* Description  : Configures port pins.
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_port_enable_rmii(uint8_t connect)
{
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
    /*
    Pin Functions : Port
    --------------------
    ET0_MDC        : P72
    ET0_MDIO       : P71
    ET0_WOL        : NC
    ET0_LINKSTA    : P34
    ET0_EXOUT      : NC
    REF50CK0       : P76
    RMII0_TXD1     : P82
    RMII0_TXD0     : P81
    RMII0_TXD_EN   : P80
    RMII0_RXD1     : P74
    RMII0_RXD0     : P75
    RMII0_RX_ER    : P77
    RMII0_CRS_DV   : P83
    */
        PORT3.PDR.BIT.B4 = 0;
        PORT7.PDR.BIT.B1 = 0;
        PORT7.PDR.BIT.B2 = 0;
        PORT7.PDR.BIT.B4 = 0;
        PORT7.PDR.BIT.B5 = 0;
        PORT7.PDR.BIT.B6 = 0;
        PORT7.PDR.BIT.B7 = 0;
        PORT8.PDR.BIT.B0 = 0;
        PORT8.PDR.BIT.B1 = 0;
        PORT8.PDR.BIT.B2 = 0;
        PORT8.PDR.BIT.B3 = 0;

        PORT3.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B1 = 0;
        PORT7.PMR.BIT.B2 = 0;
        PORT7.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B5 = 0;
        PORT7.PMR.BIT.B6 = 0;
        PORT7.PMR.BIT.B7 = 0;
        PORT8.PMR.BIT.B0 = 0;
        PORT8.PMR.BIT.B1 = 0;
        PORT8.PMR.BIT.B2 = 0;
        PORT8.PMR.BIT.B3 = 0;
    }

    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
    /*
    Pin Functions : Port
    --------------------
    ET1_MDC        : P31
    ET1_MDIO       : P30
    ET1_LINKSTA    : P93
    ET1_EXOUT      : NC
    REF50CK1       : PG0
    RMII1_TXD1     : PG4
    RMII1_TXD0     : PG3
    RMII1_TXD_EN   : P60
    RMII1_RXD1     : P95
    RMII1_RXD0     : P94
    RMII1_RX_ER    : PG1
    RMII1_CRS_DV   : P92
    */

