pwbf/RX64M_Vibration/src/r_ether_rx/src/targets/rx/r_ether_setting_rx.c
    /* Clear PDR and PMR */
        PORT3.PDR.BIT.B0 = 0;
        PORT3.PDR.BIT.B1 = 0;
        PORT6.PDR.BIT.B0 = 0;
        PORT9.PDR.BIT.B2 = 0;
        PORT9.PDR.BIT.B3 = 0;
        PORT9.PDR.BIT.B4 = 0;
        PORT9.PDR.BIT.B5 = 0;
        PORTG.PDR.BIT.B0 = 0;
        PORTG.PDR.BIT.B1 = 0;
        PORTG.PDR.BIT.B3 = 0;
        PORTG.PDR.BIT.B4 = 0;

        PORT3.PMR.BIT.B0 = 0;
        PORT3.PMR.BIT.B1 = 0;
        PORT6.PMR.BIT.B0 = 0;
        PORT9.PMR.BIT.B2 = 0;
        PORT9.PMR.BIT.B3 = 0;
        PORT9.PMR.BIT.B4 = 0;
        PORT9.PMR.BIT.B5 = 0;
        PORTG.PMR.BIT.B0 = 0;
        PORTG.PMR.BIT.B1 = 0;
        PORTG.PMR.BIT.B3 = 0;
        PORTG.PMR.BIT.B4 = 0;
    }

    /* PFS register write protect off */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);

    /* Select pin function */
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
        /* ET0 */
        MPC.P34PFS.BYTE = 0x11;
        MPC.P71PFS.BYTE = 0x11;
        MPC.P72PFS.BYTE = 0x11;
        MPC.P74PFS.BYTE = 0x12;
        MPC.P75PFS.BYTE = 0x12;
        MPC.P76PFS.BYTE = 0x12;
        MPC.P77PFS.BYTE = 0x12;
        MPC.P80PFS.BYTE = 0x12;
        MPC.P81PFS.BYTE = 0x12;
        MPC.P82PFS.BYTE = 0x12;
        MPC.P83PFS.BYTE = 0x12;
    }

    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
        /* ET1 */
        MPC.P30PFS.BYTE = 0x14;
        MPC.P31PFS.BYTE = 0x14;
        MPC.P60PFS.BYTE = 0x15;
        MPC.P92PFS.BYTE = 0x15;
        MPC.P93PFS.BYTE = 0x14;
        MPC.P94PFS.BYTE = 0x15;
        MPC.P95PFS.BYTE = 0x15;
        MPC.PG0PFS.BYTE = 0x15;
        MPC.PG1PFS.BYTE = 0x15;
        MPC.PG3PFS.BYTE = 0x15;
        MPC.PG4PFS.BYTE = 0x15;
    }

    /* PFS register write protect on */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);

    /* Switch to the selected input/output function */
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
        /* ET0 */
        MPC.PFENET.BIT.PHYMODE0 = 0; /* Select Ethernet mode    RMII mode for ch0 */

        PORT3.PMR.BIT.B4 = 1;
        PORT7.PMR.BIT.B1 = 1;
        PORT7.PMR.BIT.B2 = 1;
        PORT7.PMR.BIT.B4 = 1;
        PORT7.PMR.BIT.B5 = 1;
        PORT7.PMR.BIT.B6 = 1;
        PORT7.PMR.BIT.B7 = 1;
        PORT8.PMR.BIT.B0 = 1;
        PORT8.PMR.BIT.B1 = 1;
        PORT8.PMR.BIT.B2 = 1;
        PORT8.PMR.BIT.B3 = 1;
    }

    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
        /* ET1 */
        MPC.PFENET.BIT.PHYMODE1 = 0; /* Select Ethernet mode    RMII mode for ch1 */
        
        PORT3.PMR.BIT.B0 = 1;
        PORT3.PMR.BIT.B1 = 1;
        PORT6.PMR.BIT.B0 = 1;
        PORT9.PMR.BIT.B2 = 1;
        PORT9.PMR.BIT.B3 = 1;
        PORT9.PMR.BIT.B4 = 1;
        PORT9.PMR.BIT.B5 = 1;
        PORTG.PMR.BIT.B0 = 1;
        PORTG.PMR.BIT.B1 = 1;
        PORTG.PMR.BIT.B3 = 1;
        PORTG.PMR.BIT.B4 = 1;
    }
} /* End of function ether_port_enable_rmii() */

/***********************************************************************************************************************
* Function Name: ether_port_disable_rmii
* Description  : Configures port pins.
* Arguments    : channel -
*                    Ethernet channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_port_disable_rmii(uint8_t connect)
{
    if (PORT_CONNECT_ET0 == (connect & PORT_CONNECT_ET0))
    {
    /*
    Pin Functions : Port
    --------------------
    ET0_MDC        : P72
    ET0_MDIO       : P71
    ET0_WOL        : NC
    ET0_LINKSTA    : P34
    ET0_EXOUT      : NC
    REF50CK0       : P76
    RMII0_TXD1     : P82
    RMII0_TXD0     : P81
    RMII0_TXD_EN   : P80
    RMII0_RXD1     : P74
    RMII0_RXD0     : P75
    RMII0_RX_ER    : P77
    RMII0_CRS_DV   : P83
    */
       /* Output data */
        PORT3.PODR.BIT.B4 = 0;      /* ET0_LINKSTA  -> P34(don't care) */
        PORT7.PODR.BIT.B1 = 0;      /* ET0_MDIO     -> P71(don't care) */
        PORT7.PODR.BIT.B2 = 0;      /* ET0_MDC      -> P72(Low Output) 
                                       So as not to take data when the state of MDC is irregularity, Low is output from
                                        MDC. */
        PORT7.PODR.BIT.B4 = 0;      /* RMII0_RXD1   -> P74(don't care) */
        PORT7.PODR.BIT.B5 = 0;      /* RMII0_RXD0   -> P75(don't care) */
        PORT7.PODR.BIT.B6 = 0;      /* REF50CK0     -> P76(don't care) */
        PORT7.PODR.BIT.B7 = 0;      /* RMII0_RX_ER  -> P77(don't care) */
        PORT8.PODR.BIT.B0 = 0;      /* RMII0_TXD_EN -> P80(Low Output:deassert) */
        PORT8.PODR.BIT.B1 = 0;      /* RMII0_TXD0   -> P81(don't care) */
        PORT8.PODR.BIT.B2 = 0;      /* RMII0_TXD1   -> P82(don't care) */
        PORT8.PODR.BIT.B3 = 0;      /* RMII0_CRS_DV -> P83(don't care) */
        
        /* Direction */
        PORT3.PDR.BIT.B4 = 0;       /* ET0_LINKSTA  -> P34(input)  */
        PORT7.PDR.BIT.B1 = 0;       /* ET0_MDIO     -> P71(input)  */
        PORT7.PDR.BIT.B2 = 1;       /* ET0_MDC      -> P72(output) */
        PORT7.PDR.BIT.B4 = 0;       /* RMII0_RXD1   -> P74(input)  */
        PORT7.PDR.BIT.B5 = 0;       /* RMII0_RXD0   -> P75(input)  */
        PORT7.PDR.BIT.B6 = 0;       /* REF50CK0     -> P76(input)  */
        PORT7.PDR.BIT.B7 = 0;       /* RMII0_RX_ER  -> P77(input)  */
        PORT8.PDR.BIT.B0 = 1;       /* RMII0_TXD_EN -> P80(output) */
        PORT8.PDR.BIT.B1 = 1;       /* RMII0_TXD0   -> P81(output) */
        PORT8.PDR.BIT.B2 = 1;       /* RMII0_TXD1   -> P82(output) */
        PORT8.PDR.BIT.B3 = 0;       /* RMII0_CRS_DV -> P83(input)  */
    
        /* Port mode */
        PORT3.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B1 = 0;
        PORT7.PMR.BIT.B2 = 0;
        PORT7.PMR.BIT.B4 = 0;
        PORT7.PMR.BIT.B5 = 0;
        PORT7.PMR.BIT.B6 = 0;
        PORT7.PMR.BIT.B7 = 0;
        PORT8.PMR.BIT.B0 = 0;
        PORT8.PMR.BIT.B1 = 0;
        PORT8.PMR.BIT.B2 = 0;
        PORT8.PMR.BIT.B3 = 0;
    }

