pwbf/RX64M_Vibration/src/r_ether_rx/src/targets/rx/r_ether_setting_rx.c
    if (PORT_CONNECT_ET1 == (connect & PORT_CONNECT_ET1))
    {
    /*
    Pin Functions : Port
    --------------------
    ET1_MDC        : P31
    ET1_MDIO       : P30
    ET1_LINKSTA    : P93
    ET1_EXOUT      : NC
    REF50CK1       : PG0
    RMII1_TXD1     : PG4
    RMII1_TXD0     : PG3
    RMII1_TXD_EN   : P60
    RMII1_RXD1     : P95
    RMII1_RXD0     : P94
    RMII1_RX_ER    : PG1
    RMII1_CRS_DV   : P92
    */

    /* Clear PDR and PMR */
        /* Output data */
        PORT3.PODR.BIT.B0 = 0;       /* ET1_MDIO     ->P30(don't care) */
        PORT3.PODR.BIT.B1 = 0;       /* ET1_MDC      ->P31(Low Output) 
                                        So as not to take data when the state of MDC is irregularity, Low is output
                                         from MDC. */
        PORT6.PODR.BIT.B0 = 0;       /* RMII1_TXD_EN ->P60(Low Output:deassert) */
        PORT9.PODR.BIT.B2 = 0;       /* RMII1_CRS_DV ->P92(don't care) */
        PORT9.PODR.BIT.B3 = 0;       /* ET1_LINKSTA  ->P93(don't care) */
        PORT9.PODR.BIT.B4 = 0;       /* RMII1_RXD0   ->P94(don't care) */
        PORT9.PODR.BIT.B5 = 0;       /* RMII1_RXD1   ->P95(don't care) */
        PORTG.PODR.BIT.B0 = 0;       /* REF50CK1     ->PG0(don't care) */
        PORTG.PODR.BIT.B1 = 0;       /* RMII1_RX_ER  ->PG1(don't care) */
        PORTG.PODR.BIT.B3 = 0;       /* RMII1_TXD0   ->PG3(don't care) */
        PORTG.PODR.BIT.B4 = 0;       /* RMII1_TXD1   ->PG4(don't care) */

        /* Direction */
        PORT3.PDR.BIT.B0 = 0;       /* ET1_MDIO     ->P30(input)  */
        PORT3.PDR.BIT.B1 = 1;       /* ET1_MDC      ->P31(output) */
        PORT6.PDR.BIT.B0 = 1;       /* RMII1_TXD_EN ->P60(output) */
        PORT9.PDR.BIT.B2 = 0;       /* RMII1_CRS_DV ->P92(input)  */
        PORT9.PDR.BIT.B3 = 0;       /* ET1_LINKSTA  ->P93(input)  */
        PORT9.PDR.BIT.B4 = 0;       /* RMII1_RXD0   ->P94(input)  */
        PORT9.PDR.BIT.B5 = 0;       /* RMII1_RXD1   ->P95(input)  */
        PORTG.PDR.BIT.B0 = 0;       /* REF50CK1     ->PG0(input)  */
        PORTG.PDR.BIT.B1 = 0;       /* RMII1_RX_ER  ->PG1(input)  */
        PORTG.PDR.BIT.B3 = 1;       /* RMII1_TXD0   ->PG3(output) */
        PORTG.PDR.BIT.B4 = 1;       /* RMII1_TXD1   ->PG4(output) */
        
        /* Port mode */
        PORT3.PMR.BIT.B0 = 0;
        PORT3.PMR.BIT.B1 = 0;
        PORT6.PMR.BIT.B0 = 0;
        PORT9.PMR.BIT.B2 = 0;
        PORT9.PMR.BIT.B3 = 0;
        PORT9.PMR.BIT.B4 = 0;
        PORT9.PMR.BIT.B5 = 0;
        PORTG.PMR.BIT.B0 = 0;
        PORTG.PMR.BIT.B1 = 0;
        PORTG.PMR.BIT.B3 = 0;
        PORTG.PMR.BIT.B4 = 0;
    }

} /* End of function ether_port_disable_rmii() */

#endif  /* ETHER_CFG_MODE_SEL == 1 */

/* End of File */
